tutorials/multicomponentFluid/smallPoolFire3D/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

patches
{
    inlet
    {
        // Dictionary to construct new patch from
        patchInfo
        {
            type patch;
        }

        // Construct from zone
        constructFrom zone;

        // Generate zone
        zone
        {
            type        box;
            box         (-0.1 -0.001 -0.1)(0.1 0.005 0.1);
        }
    }
}

// ************************************************************************* //
